src/Catalogs/инкСотрудники/инкСотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>инкСотрудники</name>
  <attributes>
    <name>Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВыдан</name>
    <type>
      <types>CatalogRef.инкПодразделенияВыдачиДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>CatalogRef.инкВидыДокументовФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатныйПроект</name>
    <type>
      <types>CatalogRef.инкЗарплатныеПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетКодВычета</name>
    <type>
      <types>CatalogRef.инкВычетыНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетКодФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетНомерУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инвалид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Иностранец</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительныйЛистПроцент</name>
    <type>
      <types>EnumRef.инкИсполнительныйЛистПроцент</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОблагаемыйДоходСНачалаГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаСтандартныхНалоговыхВычетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.инкПол</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Совместитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СовместительДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИностранца</name>
    <type>
      <types>EnumRef.инкСтатусыИностранцев</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРезидента</name>
    <type>
      <types>EnumRef.инкСтатусыРезидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловия</name>
    <type>
      <types>EnumRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСокращенное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоСотрудника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НалоговыеВычеты</name>
    <attributes>
      <name>ВычетНДФЛ</name>
      <type>
        <types>CatalogRef.инкВычетыНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РодственныеСвязи</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРодственнойСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоходСоСтраховыхВзносов</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоходСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсключениеДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеиспользованныйОтпуск</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтпуска</name>
      <type>
        <types>EnumRef.инкВидыОтпуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Дни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/инкСотрудники/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
    ПроверкаРегистрацииПрограммы(Отказ);	
	ЗаполнениеРеквизитовОбъекта(Отказ);
	
КонецПроцедуры    

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ТабельныйНомер) Тогда
		Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	ОчиститьРегистрыСведений();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьРегистрыСведений()
	
	ОчиститьРегистрСведений("инкТабельУчетаРабочегоВремени");	
	ОчиститьРегистрСведений("инкПостоянныеНачисления");	
	ОчиститьРегистрСведений("инкПостоянныеУдержания");	
		
КонецПроцедуры

Процедура ОчиститьРегистрСведений(НаименованиеСтрока)
	
	НаборЗаписей = РегистрыСведений[НаименованиеСтрока].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
		
КонецПроцедуры

Процедура ПроверкаРегистрацииПрограммы(Отказ)

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		
		Если НЕ инкОбщийСервер.ПроверкаРегистрацииПрограммы() Тогда

			СписокСотрудников = Справочники.инкСотрудники.ПолучитьСписокСотрудников(); 
			Если СписокСотрудников.Количество() >= 5 Тогда
				Отказ = Истина;
				инкОбщийКлиентСервер.СообщитьПользователю("Ограничение демо версии (одна организация и до 5-ти сотрудников). Пожалуйста зарегистрируйте программу!");
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ЗаполнениеРеквизитовОбъекта(Отказ)
	
	// Заполнение табельного номера:
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ТабельныйНомер) Тогда
		ЭтотОбъект.ТабельныйНомер = ЭтотОбъект.Код;
	КонецЕсли;
	
	ЗаполнитьФИО();

	// Имущественный вычет:
	Если ЭтотОбъект.ИмущественныйВычетСумма <> 0 Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ИмущественныйВычетКодВычета) Тогда
			Отказ = Истина;
			инкОбщийКлиентСервер.СообщитьПользователю("Внимание! У имущественного вычета должен быть указан код вычета.");
		КонецЕсли;
	КонецЕсли; 
		
КонецПроцедуры

Процедура ЗаполнитьФИО() Экспорт

    Если ЭтотОбъект.ЭтоГруппа Тогда
    	Возврат;
    КонецЕсли; 
    
	Если ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда
		
		СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Наименование);
		
		ЭтотОбъект.Фамилия = СтруктураФИО.Фамилия;
		ЭтотОбъект.Имя = СтруктураФИО.Имя;
		ЭтотОбъект.Отчество = СтруктураФИО.Отчество;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Фамилия) Тогда
			
			ЭтотОбъект.ФИОСокращенное = ЭтотОбъект.Фамилия;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Имя) Тогда
				ЭтотОбъект.ФИОСокращенное = ЭтотОбъект.ФИОСокращенное + " "
				                          + Лев(ЭтотОбъект.Имя,1)
										  + ".";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Отчество) Тогда
				ЭтотОбъект.ФИОСокращенное = ЭтотОбъект.ФИОСокращенное + " "
				                          + Лев(ЭтотОбъект.Отчество,1)
										  + ".";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтотОбъект.ФИО = ЭтотОбъект.Наименование;	
	
КонецПроцедуры

Функция ПолучитьКадровыеДанныеСотрудникаВСтруктуру(Сотрудник,Дата = Неопределено) Экспорт
	
	Возврат инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(Сотрудник,Дата);
		
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
